import pandas as pd

df1 = pd.read_excel('./남북한발전전력량.xlsx')
df2 = pd.read_excel('./남북한발전전력량.xlsx', header=None)

print(df1)
print('\n')
print(df2)

#    남북한별  발전 전력별       2017   2017.1       2018   2018.1       2019   2019.1
# 0  남북한별  발전 전력별  전력량 (억㎾h)  구성비 (%)  전력량 (억㎾h)  구성비 (%)  전력량 (억㎾h)  구성비 (%)
# 1    북한      합계        235      100        249      100        238      100
# 2   NaN      수력        119     50.6        128     51.4        110     46.2
# 3   NaN      화력        116     49.4        121     48.6        128     53.8
# 4    남한      합계       5535      100       5706      100       5630      100
# 5   NaN      수력         70      1.3         73      1.3         62      1.1
# 6   NaN      화력       3738     67.5       4018     70.4       3796     67.4
# 7   NaN     원자력       1484     26.8       1335     23.4       1459     25.9
# 8   NaN     신재생        243      4.4        281      4.9        313      5.6


#       0       1          2        3          4        5          6        7
# 0  남북한별  발전 전력별       2017     2017       2018     2018       2019     2019
# 1  남북한별  발전 전력별  전력량 (억㎾h)  구성비 (%)  전력량 (억㎾h)  구성비 (%)  전력량 (억㎾h)  구성비 (%)
# 2    북한      합계        235      100        249      100        238      100
# 3   NaN      수력        119     50.6        128     51.4        110     46.2
# 4   NaN      화력        116     49.4        121     48.6        128     53.8
# 5    남한      합계       5535      100       5706      100       5630      100
# 6   NaN      수력         70      1.3         73      1.3         62      1.1
# 7   NaN      화력       3738     67.5       4018     70.4       3796     67.4
# 8   NaN     원자력       1484     26.8       1335     23.4       1459     25.9
# 9   NaN     신재생        243      4.4        281      4.9        313      5.6
